{
  "title": "Against 'One-Way Streets'",
  "date": "June 08, 2025",
  "subtitle": "Enable hypovigilance",
  "category": "writing",
  "content": "<p><a href=\"https://lydianottingham.substack.com/s/practical/?utm_source=substack&amp;utm_medium=menu\">Practical</a></p>\n<h1>Against 'One-Way Streets'</h1>\n\n<ol>\n<li>\n<p>When I started university, I took out an £800 loan to help cover living costs. Later in the year, I had enough money to pay back this loan. I immediately paid back the entire £800. Later, I learned that if I’d paid back only a penny, up to £1.5k would’ve been taken off my loan balance . I called the administrators, but because the first repayment → partial cancellation system was automated, I couldn’t get credited £800. I wasn’t shown the £1.5k cancellation scheme when I made my voluntary repayment. </p>\n</li>\n<li>\n<p>On Substack, once you upload a ‘Social Preview’ image, you can’t return to your post being imageless. You’re not told this when you upload a ‘Social Preview’ image. I think I remember the depths of Substack technical support webpages saying this is to “improve your post’s engagement”, but that seems to be mostly for Substack’s sake. I imagine ‘required’ could be easily untoggled.</p>\n</li>\n</ol>\n<p><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!IzfB!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb76cbefa-e4f5-45ca-a027-3701591999bc_1272x465.png\" /></p>\n<p>Each of these represents a case where had I been more hypervigilant—had I read information that wasn’t in the smallprint, but was in the depths of other, non-linked webpages / other people’s experiences—I could’ve ended up in a better situation (£800 up, ‘Avocado Experiment’ suitably imageless). </p>\n<p>I claim it’s pretty bad when institutions set up these schemes. You take an action, but you wouldn’t have taken the action if you knew all the information the institution does—and now the institution won’t restore your last checkpoint, even when administratively straightforward.</p>\n<p>Above all, institutions can avoid this through proactive transparency! When someone starts to take an irreversible action, tell them everything they might want to know upfront. If you didn’t tell them info you might reasonably have, try to restore the earlier checkpoint. This makes society higher-trust.</p>\n<p><img alt=\"\" src=\"https://substackcdn.com/image/fetch/$s_!o9hO!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0209995e-07b4-402b-8f17-cbc48fc283c7_883x272.png\" /></p>\n\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/against-one-way-street-hypervigilance\">Substack</a></em></p>"
}