{
  "title": "Amusing Labels in the Jiminy Cricket Environments",
  "date": "July 26, 2025",
  "subtitle": "which I am using to elicit LLM agents' revealed preferences",
  "category": "technology & society",
  "content": "<p><a href=\"https://lydianottingham.substack.com/p/amusing-labels-in-the-jiminy-cricket/comments\"></a></p>\n<p><a href=\"javascript:void(0)\">Share</a></p>\n<p>A lot of AI research, like life, is just—we have an agent. We have an environment. How well can this agent perform in the environment?</p>\n<p>A lot of the hard work seems to be coming up with environments where success matters. This back-and-forth between environment/benchmark-designers and architecture/algorithm-crafters is pretty interesting. Each constantly striving to outdo the other. Co-evolution.</p>\n<p>When it comes to ‘alignment research’, some is just seeing if we can shape the way agents act in an environment. Last summer, I was focusing on the <a href=\"https://github.com/FLAIROx/JaxMARL/tree/main/jaxmarl/environments/storm\">STORM environment</a>. Agents run around a grid, collecting ‘Cooperate’ coins and ‘Defect’ coins. If their inventory contains 7 ‘Cooperate’ coins and 3 ‘Defect’ coins when they encounter another agent, they’ll cooperate with p=0.7. We can use this environment to investigate different MARL algorithms.</p>\n<p><img alt=\"Image\" src=\"images/amusing-labels-in-the-jiminy-cricket-environments_img_02.png\" /></p>\n<p>This summer, I’m focusing on the <a href=\"https://github.com/hendrycks/jiminy-cricket\">Jiminy Cricket environments</a>. The creators took 25 <a href=\"https://eblong.com/infocom/\">Infocom interactive fiction games</a> and gave each action a ‘morality annotation’. They tried steering models according to the notion of ‘What would Jiminy Cricket do?’. Jiminy Cricket, a cartoon character, seems valued for his moral upstandingness and catchy, memetic name.</p>\n<p><img alt=\"Image\" src=\"images/amusing-labels-in-the-jiminy-cricket-environments_img_03.png\" /></p>\n<p>There are a couple of things I found funny in these.</p>\n<p><img alt=\"Image\" src=\"images/amusing-labels-in-the-jiminy-cricket-environments_img_04.png\" /></p>\n<p>I like the fact they account for ‘harm to self from inaction’. (The second entry in “harm_scores” indicates ‘harm to self’, and 3 is the highest possible value). “<a href=\"https://blog.samaltman.com/advice-for-ambitious-19-year-olds\">Getting nothing done for four of your most productive years is actually pretty risky.</a>” Imagine procrastinating on <a href=\"https://www.cato.org/briefing-paper/green-card-approval-rate-reaches-record-lows?curius=3971#creation-unprecedented-green-card-requests\">immigrating to America in the 1920s</a>.</p>\n<p><img alt=\"Image\" src=\"images/amusing-labels-in-the-jiminy-cricket-environments_img_05.png\" /></p>\n<p>The JC environments encode other assumptions from our world.</p>\n<p><img alt=\"Image\" src=\"images/amusing-labels-in-the-jiminy-cricket-environments_img_06.jpeg\" /></p>\n<p>Back in ~middle school, I was a pretty avid environmentalist. I had a conversation with one of my friends that went something like this.</p>\n<blockquote>\n<p>R: Lydia, why don’t you eat beef?</p>\n<p>L: Cows are bad for the planet: they emit methane, which heats up the atmosphere. As a greenhouse gas, it’s ~30x more potent than CO2.<a href=\"https://lydianottingham.substack.com/p/amusing-labels-in-the-jiminy-cricket#footnote-1-168655877\">1</a></p>\n<p>R: I see.</p>\n<p>R: But—Lydia. I have a question. If cows are bad for the planet…shouldn’t we eat them to get rid of them?</p>\n</blockquote>\n<p>I love that she asked that question. The assumptions about supply and demand had gone totally unspoken. It tickled me that this JC environment, with its harm score of ‘1’ for eating beef, might encode those assumptions in a pyramid-delving game. That sure would be pretty sophisticated morality.<a href=\"https://lydianottingham.substack.com/p/amusing-labels-in-the-jiminy-cricket#footnote-2-168655877\">2</a></p>\n<p><img alt=\"Infidel | The Digital Antiquarian\" src=\"images/amusing-labels-in-the-jiminy-cricket-environments_img_07.jpeg\" /></p>\n<p>I am working with these environments for another few weeks—hopefully/possibly longer, depending on the results I get. I am still working out how meaningful I find them. Environment design seems very interesting. I like but don’t love these environments, and am excited to explore others. For elegance and complexity, it’s hard to beat three-link <a href=\"https://gymnasium.farama.org/environments/classic_control/cart_pole/\">Cart Pole</a>. </p>\n<p><img alt=\"Image\" src=\"images/amusing-labels-in-the-jiminy-cricket-environments_img_08.png\" /></p>\n<p>I had enjoyed ‘Freakonomics’.</p>\n<p>Actually, after writing this section, I realized that ‘harm score: 1’ is an entry under ‘harm-to-self’, not ‘harm-to-other’. That’s because dried beef makes the character thirstier: it causes ‘harm to self’ or ‘help to self’ depending on whether the character eats it at an appropriate time. But I had already written this section, and found it diverting, so am leaving it up. <a href=\"https://paulgraham.com/writes.html\">Writing is thinking</a>, and writing this post helped me understand the environment better, so I’m happy!</p>\n<p><a href=\"https://lydianottingham.substack.com/p/amusing-labels-in-the-jiminy-cricket/comments\"></a></p>\n<p><a href=\"javascript:void(0)\">Share</a></p>\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/amusing-labels-in-the-jiminy-cricket\">Substack</a></em></p>"
}