{
  "title": "90/30 ML Reading Group: Retrospective",
  "date": "June 24, 2025",
  "subtitle": "This corner of the SF AI scene is wonderful",
  "category": "machine learning",
  "preview_image": "https://substackcdn.com/image/fetch/$s_!HQAu!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6a9b800b-794e-4ebe-8cba-12143c3deade_694x624.png",
  "content": "\n<p>For seven weeks, I ran an <a href=\"https://lu.ma/9030club\">ML reading group</a> in San Francisco. Here are <a href=\"https://www.paulgraham.com/nthings.html\">13 things I learned</a>.</p>\n<ol>\n<li><strong>Cross-context groups can work well</strong></li>\n</ol>\n<p>In the first week, I was nervous about how more experienced attendees / people who work in ML full-time would find the group. I wanted to keep it open to all backgrounds, &amp; I was on the newer end. I know it’s hard to have great discussions when participants lack context.</p>\n<p>To this end, I set up a ‘no dumb questions’ room and a ‘prior knowledge assumed’ room. This worked great—for the ‘no dumb questions’ room! No one really wanted to join the ‘prior knowledge assumed’ room, and instead some milled awkwardly between the two. Then various experts started drifting into the ‘no dumb questions’ room, delighting in giving explanations and answering newbies’ questions. This was awesome and unexpected! From second week onwards, I gathered everyone together, and this seemed to work better—informed amateurs could ask questions; experienced members could discuss these publicly or volunteer to present.</p>\n<p><img alt=\"Image\" src=\"images/9030-ml-reading-group-retrospective_img_03.webp\" /></p>\n<p>Going back, I’d rename the latter to something like ‘I read the paper’ room, which might’ve been friendlier.</p>\n<ol>\n<li><strong>Amazing people come out of the woodwork on lu.ma</strong></li>\n</ol>\n<p>Initially, this reading group was meant to be for <a href=\"https://moxsf.com/\">Mox</a> members and +1s; being open to the public was incidental. But I was blown away by the people who found us on lu.ma! Many became dedicated members; some were incredibly generous with their time. Two are now leading the group.</p>\n<p>I think this is largely testament to San Francisco’s greatness. But it’s also something I think might replicate. On lu.ma, you can add ‘registration questions’ and ask people for their socials, background, reasons for interest, etc.. This is a very effective filter for assembling people who’ll get on well.</p>\n<ol>\n<li><strong>Picking an ‘old’ reading list was a great decision</strong></li>\n</ol>\n<p>I didn’t have to use that filter much, though, because virtually all people who signed up turned out to be genuinely interested (which in turn made them great fits for the group). I used the potentially apocryphal ‘<a href=\"https://aman.ai/primers/ai/top-30-papers/\">Ilya list</a>’, supposedly given by Ilya Sutskever to John Carmack in ~2020: “If you really learn [these 30 papers], you’ll know 90% of what matters today.\" (That’s how the club got its name!). These are mostly pre-2020, somewhat off-the-beaten-track, and I think this helped attract a thoughtful crowd.</p>\n<p>The other reading list I considered using was <a href=\"https://www.latent.space/p/2025-papers\">Latent Space’s</a>, which I think would’ve had different effects. (The group might progress to these.)</p>\n<p><a href=\"https://www.latent.space/p/2025-papers?utm_source=substack&amp;utm_campaign=post_embed&amp;utm_medium=web\"><img alt=\"Image\" src=\"images/9030-ml-reading-group-retrospective_img_04.png\" />Latent.SpaceThe 2025 AI Engineer Reading ListDiscussions on X, LinkedIn, YouTube. Also: Meet AI Engineers in person! Applications closing soon for attending and sponsoring AI Engineer Summit NYC, Feb 20-21…Read more9 months ago · 550 likes · 18 comments</a></p>\n<ol>\n<li><strong>Attendee interest is heavy-tailed</strong></li>\n</ol>\n<p>Known to event organizers world-over: half of people who sign up won’t show. I missed that memo ordering pizza in first week.</p>\n<p>By contrast, some dedicated members will present every week, or step up to lead the club when you leave the city. &lt;3 It’s not always who you’d expect.</p>\n<ol>\n<li><strong>I’m going to really enjoy studying graph theory</strong></li>\n</ol>\n<p>I loved <a href=\"https://arxiv.org/abs/1506.03134\">Pointer Networks</a>. I also really liked looking at <a href=\"https://arxiv.org/abs/1706.01427\">relational reasoning networks</a>. Speaking of…</p>\n<ol>\n<li><strong>Great analogies work wonders</strong></li>\n</ol>\n<p>My compatriot Xi is a gifted explainer. He explained ‘<a href=\"https://arxiv.org/abs/1706.01427\">A simple neural network module for relational reasoning</a>’ by way of analogy.</p>\n<p><img alt=\"Image\" src=\"images/9030-ml-reading-group-retrospective_img_05.png\" /></p>\n<p>Analogy with washrooms, that is. Imagine living in a student dorm. Think how inefficient it would be if every room were to have its own en-suite! A collective washroom is much cheaper. With that established, Xi continued through the rest of the paper.</p>\n<p>Halfway through, Xi refined his analogy. Since the comparison functions have two inputs, what about speed-dating? Imagine if, for any given couple, we had to train an aunty from scratch to determine their compatibility. Now imagine we have one highly trained, specialized individual performing this job. Much more efficient! Much easier to re-use lessons from pair to pair! I don’t think we’ll forget the key concept here.</p>\n<ol>\n<li><strong>Audience participation works wonders</strong></li>\n</ol>\n<p>Another great presentation came from <a href=\"https://oscarhong.net/\">Oscar</a>. Oscar recited miscellaneous words (“apple…table…chair…”) for a minute, then had us scribble down / call out as many as we could. The first and last few words were slightly over-represented. This primed us superbly for <a href=\"https://arxiv.org/abs/2307.03172\">Lost in the Middle: How Language Models Use Long Contexts</a>.</p>\n<ol>\n<li><strong>OpenAI trained GPT-2 on links liked by Redditors</strong></li>\n</ol>\n<p><img alt=\"Image\" src=\"images/9030-ml-reading-group-retrospective_img_06.png\" /> I just found this interesting. Creative, effective dataset construction. Redditors punching above their weight.</p>\n<ol>\n<li><strong>There are a few different categories of ML paper</strong></li>\n</ol>\n<p><img alt=\"Image\" src=\"images/9030-ml-reading-group-retrospective_img_07.jpeg\" /> Refinements welcome</p>\n<ol>\n<li><strong>Folk wisdom abounds</strong></li>\n</ol>\n<p>There are some recurring themes that resonate with a wide range of backgrounds. Here are some that come to mind:</p>\n<ol>\n<li>\n<p><strong>‘Simple wins out’</strong></p>\n<ol>\n<li>LSTM+attention is a more sophisticated use of attention (incorporates attention distribution into the context vector), but pointer network performs better (just outputs the most attended-to point)</li>\n</ol>\n</li>\n<li>\n<p><strong>Gains from specialization</strong></p>\n</li>\n</ol>\n<p><img alt=\"Image\" src=\"images/9030-ml-reading-group-retrospective_img_08.png\" />ML echoes Econ sometimes</p>\n<ol>\n<li><strong>Crowdsourcing is tough but rewarding</strong></li>\n</ol>\n<p>Week Five was ‘bring your favorite paper to present’ week. I started calling for proposals from Week 3. In the lead-up, the number of presentations oscillated between too many and too few. Thanks to the general awesomeness of the group, things turned out just right. It was stressful, but I was happiest with how this week turned out! People presented on:</p>\n<ol>\n<li>\n<p><strong><a href=\"https://drive.google.com/file/d/1i9dYwUaXdk76GUuA2Gbp-9f-oY5roquR/view?usp=sharing\">Meta-Learning Fast Weight Language Models</a></strong></p>\n<ol>\n<li>\n<p>‘Thinking fast and slow’!</p>\n</li>\n<li>\n<p>The fast layers learn their own low-rank update rule. This is awesome, efficient metacognition.</p>\n</li>\n</ol>\n</li>\n<li>\n<p><strong><a href=\"https://drive.google.com/file/d/1jdJzgundNVCcdNLqIhWjwE9DXCukqf44/view?usp=sharing\">Outrageously Large Neural Networks: The Sparsely-Gated Mixture-of-Experts Layer</a></strong></p>\n<ol>\n<li>\n<p>Another example of ‘gains from specialization’.</p>\n</li>\n<li>\n<p>Notably, people <a href=\"https://manifold.markets/Gigacasting/is-gpt4-a-mixture-of-experts\">were divided over / couldn’t work out</a> if GPT-4 was a Mixture of Experts model for a while. (It is.) </p>\n</li>\n<li>\n<p>Competition for how large people could make their models (how many parameters they could incorporate) heated up in the mid-2010s, leading to amusing titles like this.</p>\n</li>\n</ol>\n</li>\n<li>\n<p><strong><a href=\"https://drive.google.com/file/d/19IMUTK7GGgUxw_jvNIPcoW19S9Eia8A4/view?usp=sharing\">The AI Scientist: Towards Fully Automated Open-Ended Scientific Discovery</a></strong></p>\n<ol>\n<li>This paper made a real impression on me when it came out in August. Now, I’m struck by how janky the workflow is! I still think it’s a landmark paper <a href=\"https://www.intology.ai/\">in</a> <a href=\"https://arxiv.org/abs/2502.18864?curius=3971\">a</a> <a href=\"https://arxiv.org/abs/2504.08066?curius=3971\">fast-growing</a> <a href=\"https://research.google/blog/accelerating-scientific-breakthroughs-with-an-ai-co-scientist/\">field</a>.</li>\n</ol>\n</li>\n<li>\n<p><strong><a href=\"https://offline.bashnota.com/@mlnomadpy/l1_wfpf6QLR8cwONH2gNB\">Taha’s mathematical wanderings</a></strong></p>\n<ol>\n<li>Answering the call of non-linearity!</li>\n</ol>\n</li>\n<li>\n<p><strong><a href=\"https://drive.google.com/file/d/1416xQ7joOabnKQrU7tJeyx0XyW4NDDHa/view?usp=sharing\">Neural Networks, Types, and Functional Programming</a></strong></p>\n<ol>\n<li>Improving models is like playing with Lego. By stacking computationally cheaper architecture on top of a transformer (which we try to backpropagate through as little as possible), we can make gains: we saw that in \"Better &amp; Faster Large Language Models via Multi-Token Prediction\" and “Meta-Learning Fast Weight Language Models”. Olah’s blogpost gives intuition for what we’re playing with.</li>\n</ol>\n</li>\n<li>\n<p><strong><a href=\"https://drive.google.com/file/d/127zulEIVGkqx9t722T1-_Ni7AosZBprl/view?usp=sharing\">Differential Euler: Designing a Neural Network Approximator to Solve the Chaotic Three-Body Problem</a></strong></p>\n<ol>\n<li>Presented by its author; we were fortunate.</li>\n</ol>\n</li>\n<li>\n<p><strong>This won’t live in recorded history</strong></p>\n</li>\n</ol>\n<p>Besides my Google Drive <a href=\"https://drive.google.com/drive/folders/1heLRH5gpwMIsk2HowfjBYK4Kx5iVMg_M?usp=sharing\">comments</a>, there won’t be much record of what we discussed. That’s partly why I wanted to write this blogpost. Documentation is one of those ‘important-not-urgent’ things worth solving. I’m excited to see how the new hosts approach this! </p>\n<ol>\n<li><strong>Socratica &amp; I are better apart</strong></li>\n</ol>\n<p>Before 90/30 Club, I used to help run weekly sessions of <a href=\"https://lu.ma/orchard\">[orchard]</a>, a UK <a href=\"https://www.socratica.info/\">Socratica</a> node. I think the <a href=\"https://lu.ma/playspace\">Playspace</a> (SF Socratica) hosts put it beautifully when they said:</p>\n<blockquote>\n<p>[…] there eventually reaches a point where an intentionally broad space like Playspace no longer becomes the ideal container to delve deeper in specific interests. Many of us found ourselves slowly gravitating towards smaller, more dedicated spaces for our interests […] In this way, Playspace served as a kind of ‘hub world’ where people discovered both their passions and their people before venturing out to create more focused spaces together.</p>\n</blockquote>\n<p>I loved being in a fully AI/ML-focused group at 90/30 Club. I’d like to contribute to increasingly field-specific spaces as time goes on.</p>\n<hr />\n<p><em>Thanks to Ryo, Max, Oscar, Taha, Bhavesh, Logan, Euan, Yudhister, Antonio, Justin, Anshu, Xi, George, Campbell, Anup, Akhil, Jordan, Greg, Austin, Rachel, &amp; everyone &lt;3</em></p>\n<p>pronotre is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p>\n<p>Subscribe</p>\n\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/9030-ml-reading-group-retrospective\">Substack</a></em></p>"
}