{
  "title": "Astronomical Waste & Conscientious Objection",
  "date": "August 02, 2025",
  "subtitle": "& differential technological development",
  "category": "writing",
  "preview_image": "https://substackcdn.com/image/youtube/w_728,c_limit/Yj4H_-VOceM",
  "content": "<p><a href=\"https://lydianottingham.substack.com/s/posts-about-ai/?utm_source=substack&amp;utm_medium=menu\">AI / ML</a></p>\n<h1>Astronomical Waste &amp; Conscientious Objection</h1>\n\n<p>First, I want to say that I’m actually pretty uncertain about how much of a threat different degrees of AI development pose. But I know lots of people think ‘rationalists’ should act as though we’re in a conflict—safetyists against developers. Assuming that’s the case, I want to see where their assumptions lead re worthiness of working on different things.</p>\n<p>In this world, safetyists need to mobilize against developers, with many safetyists working directly on slowing down AI progress. That’s the force that needs to be mobilized. </p>\n<p>One might have many motivations for not wanting to join that force. One might not want to incur the costs to self from working on something that’s unpopular, poorly/non-remunerated, fringe, and/or ‘cringe’.</p>\n<p>Conditioning on conflict being the right frame here, I see the main moral motivation for not joining that force as stemming from <a href=\"https://nickbostrom.com/papers/astronomical-waste/\">Astronomical Waste</a>. <em>God, technological progress is so precious and fragile. I’m terrified of doing something to disrupt it. People will suffer and die—or just continue living deeply uncomfortable lives—if we slow / shut down the only means, technological progress, that we have to change that.</em></p>\n<p>Back to the ‘mobilization’ metaphor. In historical cases of military mobilization, you have ‘draft-dodgers’ who supposedly just don’t want to enlist for self-interested reasons. And then you have ‘conscientious objectors’, who claim exemption on moral / religious grounds. It was fairly shameful to be a conscientious objector during WW1 / WW2 — there was peer pressure and accusations of free-riding, cowardice, etc. etc..</p>\n<p>How have conscientious objectors kept face in the long view of history? By doing work at least as miserable and critical as that of soldiers on the front line. I knew of <a href=\"https://www.bbc.co.uk/history/ww2peopleswar/stories/45/a6117545.shtml\">railway workers</a> in Britain, but today I learned of the <a href=\"https://www.nationalww2museum.org/war/articles/conscientious-objectors-civilian-public-service\">starvation study</a>, using conscientious objectors as guinea pigs, conducted at the University of Minnesota in 1944. That’s some pretty intense service!</p>\n<p>Assuming safetyists are obligated to frustrate AI development—what kind of work can Astronomical-Waste-driven ‘Conscientious Objectors’ get up to? To me, the answer lies in differential technological development—accelerating technologies, esp. in alignment, that are more ‘clearly very good’ than dangerous. This way, you’re not committing the victimful sin of quashing human innovation, but you are still participating in the war effort.</p>\n<p>There’s some cold water here, which is that Britain/America probably needed far more soldiers than conscientious objectors to win their respective conflicts. I recently watched a <a href=\"https://lu.ma/do1cdytk?tk=NZXGA6\">talk</a> suggesting “everyone wants to be the good cop—but a pressure movement needs a whole lot more bad cops than good.”<a href=\"https://lydianottingham.substack.com/p/astronomical-waste-and-conscientious#footnote-1-169711323\">1</a></p>\n<p>Independent of whether we’re in an AI-conflict-world—after all, we’re <a href=\"https://forum.effectivealtruism.org/posts/vQpk3cxdAe5RX9xzo/we-are-in-triage-every-second-of-every-day\">in triage every second of every day</a>—what other lessons can we take from the legacy of conscientious objection? If I assume a more ‘comfortable’ role, I want to reflect on why, as well as feel, and act on, my duty towards people who take less comfortable, equally critical, roles. I’ve always felt uncomfortable about the sheen of ‘comparative advantage’ . In the case of conscientious objectors, honoring this duty often meant working so hard their jobs couldn’t be deemed more ‘comfortable’ by the end.<a href=\"https://lydianottingham.substack.com/p/astronomical-waste-and-conscientious#footnote-2-169711323\">2</a></p>\n<p>There are caveats—we’re entering a world where one can work smart, not hard. We’re moving away from a world of military / political numbers towards one of drones, cyber-warfare, and so on. But I think this still matters.</p>\n<p>There is nuance here re burnout, etc.. I take this as assumed &amp; want to bite hard bullets today.</p>\n\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/astronomical-waste-and-conscientious\">Substack</a></em></p>"
}