{
  "title": "Field Notes from EAG NYC",
  "date": "October 14, 2025",
  "subtitle": "which way, scientist AI?",
  "category": "writing",
  "preview_image": "https://substackcdn.com/image/fetch/$s_!BSPQ!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa5426cb4-01fa-4c6a-8327-b77317259920_1024x1024.png",
  "content": "<h1>Field Notes from EAG NYC</h1>\n\n<h3>The Brittleness Problem</h3>\n<p>I don’t think I can work on LM behavior much longer. It’s too brittle, fickle, sensitive to hyperparameter perturbations—outputs stochastic in a way even <a href=\"https://arxiv.org/abs/2307.14324\">Scherrer et al.</a> can’t resolve. A grad student resonates; that’s why he’s working on <a href=\"https://arxiv.org/abs/2307.07697\">knowledge graphs</a> now.</p>\n<h3>Which Way, Scientist AI?</h3>\n<p>The <a href=\"https://arxiv.org/abs/2502.15657\">Scientist AI</a> people don’t seem to have ready answers to “how will Scientist AI expand its database / propose experiments &amp; get them approved?” I perceive two defensible positions here:</p>\n<ol>\n<li>\n<p>We can still get almost all the value we’d get from agentic / autonomous AI (scientific breakthroughs, poverty alleviation…) with non-agentic / scientist / oracle AI.</p>\n</li>\n<li>\n<p>We’re going to be leaving a lot of potential value on the table [by refusing agentic / autonomous systems], but we have no choice but to make this sacrifice.</p>\n</li>\n</ol>\n<p>They don’t make clear which position they’re defending.</p>\n<p>I of course want to see more people defend 1. But if 2 is our only option—if ‘Scientist AI’ is as far as we can go<a href=\"https://lydianottingham.substack.com/p/field-notes-from-eag-nyc#footnote-1-176117030\">1</a>—then I’m interested in how we can set standards that prepare us for Scientist AI, so it can do its darn best with a semi-static / slow-moving database. <a href=\"https://www.rory.bio/\">Rory</a> says AlphaFold only worked because all protein-folding researchers used <a href=\"https://www.rcsb.org/\">Protein Data Bank</a> in the 1980-90s, yielding abundant standardized training data. <strong>What standards can scientific conferences set today to help non-agentic AI readers?</strong></p>\n<p>Some ‘Scientist AI’ co-authors I spoke to hadn’t read “<a href=\"https://gwern.net/tool-ai\">Why Tool AIs Want To Be Agent AIs</a>”, which informs a lot of my intuitions here.</p>\n<p><img alt=\"which way, Scientist AI?\" src=\"https://substackcdn.com/image/fetch/$s_!BSPQ!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa5426cb4-01fa-4c6a-8327-b77317259920_1024x1024.png\" /></p>\n<h3>Activation Fatigue</h3>\n<p>When I discuss activation engineering woes, Linh recommends approaches I wish I had time &amp; headspace to chase down—I need to get into an environment where I can properly try solving the problems I’m working on. Notably, I really need to read up on <a href=\"https://arxiv.org/abs/2407.15549\">Latent Adversarial Training</a>.</p>\n<p>Steering vectors are <a href=\"https://arxiv.org/abs/2505.03189\">not</a> currently deployable in frontier systems.</p>\n<h3>LM Behavior</h3>\n<p>I’ve been interested in ‘stated vs. revealed preferences in LMs’ for a while now. <a href=\"https://abdur-raheem.com/\">Abdur</a> is so quick he runs a follow-up experiment on SvR right after we chat: a model tries to circumvent its max_tokens limit while claiming the limit’s chill. Quite sympathetic behavior. This is a comparatively simple / clean setup vs. <a href=\"https://www.anthropic.com/research/petri-open-source-auditing\">Petri</a> and <a href=\"https://control-arena.aisi.org.uk/\">ControlArena</a>, other possible testbeds.</p>\n<p><a href=\"https://thatadammorris.com/\">Adam</a> has a neat <a href=\"https://arxiv.org/abs/2505.17120\">approach</a> to measuring model behavior and the effects of pro-<a href=\"https://arxiv.org/abs/2410.13787\">introspection</a> interventions. If you personally specify the model’s preferences, you have a cleaner baseline vs. working with ‘native’ preferences. Something I should keep in mind on SvR project.</p>\n<p>The <a href=\"https://www.compassionml.com/\">CaML</a> people are engaging in “data poisoning for good”—controlling LMs with synthetic pro-compassion data given free to model developers and/or spread around the internet. In some ways, it’s such <a href=\"https://x.com/boops_u/status/1976656590569881811\">noble</a>, honorable work. But it also connotes ‘fighting within a broken paradigm’. The world where this is counterfactual is not the one I want to live in.</p>\n<p>I’m starting to think the best empirical LM behavior / ‘revealed preference’ analysis will take place over AI labs’ model logs, <a href=\"https://www.anthropic.com/economic-index\">AEI-style</a>, though we can operate over datasets like <a href=\"https://huggingface.co/datasets/lmsys/lmsys-chat-1m\">LMSYS-Chat-1M</a> in the meantime. </p>\n<p>According to <a href=\"https://www.povertyactionlab.org/person/lorvo\">Audre</a>y, J–Pal’s evals (on how AI helps coffee farmers etc.) will inform us about philanthropy-counterfactual AI use. For example, they’ve got preliminary results suggesting chat assistants boost entrepreneurs who were already doing well, but may be unhelpful to struggling business owners who defer and dig holes they can’t get out of.</p>\n<h3>Alignment Roundup</h3>\n<p>An ex-FHI / <a href=\"https://causalincentives.com/\">CIWG</a> researcher explains struggles doing research that’s both good and easy to fund. “Just write a paper every ~3 months.” Good advice.</p>\n<p>AE Studio is one heck of a company—using software consultancy to fund their <a href=\"https://ai-alignment.ae.studio/\">alignment research</a>. <a href=\"https://www.lesswrong.com/posts/hzt9gHpNwA2oHtwKX/self-other-overlap-a-neglected-approach-to-ai-alignment\">Self-other overlap</a>, <a href=\"https://arxiv.org/abs/2507.02092\">energy-based transformers</a>.</p>\n<p><a href=\"https://poseidonresearch.org/\">Poseidon Research</a> exists! Cryptography, steganography, LM monitoring. It’s now possible to do AIS research in Manhattan at the <a href=\"https://www.nycimpacthub.org/\">NYC Impact Hub</a>.</p>\n<p>Robotics interpretability is a growing field, with work in progress at <a href=\"https://www.pair.toronto.edu/\">PAIR Lab</a> (Yixiong) and Imperial (Ida) (VLAMs like 7B OpenVLA). </p>\n<p>The whole field of making AI science (e.g. jailbreaking) <a href=\"https://arxiv.org/abs/2501.11183\">principled</a> seems fun.</p>\n<p><a href=\"https://www.linkedin.com/in/martinleitgab/\">Martin</a> would need $20-30k to scale his literature-synthesis, intervention-extracting work from the <a href=\"https://huggingface.co/datasets/StampyAI/alignment-research-dataset\">Alignment Research Dataset</a> ($800) to all of ArXiv.</p>\n<p>Tyler G’s study list is relatable: control theory, stochastic processes, categorical systems theory, dynamical systems theory, network theory, game theory, decision theory, multiagent modeling, and formal verification. <a href=\"https://arxiv.org/abs/2405.06624\">Towards Guaranteed Safe AI</a> addresses agency, unlike Scientist AI. In general, I appreciate papers that address safe design, like <a href=\"https://arxiv.org/abs/2012.07532\">Overview of 11 Proposals</a>.</p>\n<p>Bandwidth generally high with long-time rationalists like <a href=\"https://www.lesswrong.com/users/justinshovelain\">Justin</a>, and yes, ‘stealth advisor’ is a thing you can be.</p>\n<p>Will’s <a href=\"https://willmacaskill.substack.com/p/effective-altruism-in-the-age-of\">post</a> encouraging EAs to ‘make AI go well’ seems like a helpful summary of the recent zeitgeist around me. Notably, <a href=\"https://digitaleconomy.stanford.edu/etai-course/\">ETAI</a> had this flavor. </p>\n<h3>Podcasting Tips</h3>\n<p>I hear all about podcast design from <a href=\"https://angelatan.ca/\">Angela</a>! For context, I’m thinking of starting a podcast in Oxford, mapping the work of PIs and grad students in AI, neurotech, matsci, etc. onto <a href=\"https://www.gap-map.org/\">Gap Map</a>. Apparently <a href=\"https://www.oxfordpublicphilosophy.com/\">Oxford Public Philosophy</a> are a strong local podcast.</p>\n<p>Angela’s advice for interviewing guests is this:</p>\n<ul>\n<li>\n<p>Watch their other episodes to see what they’ve spoken about before—get them off-script</p>\n</li>\n<li>\n<p>Ask about a moment where they’ve experienced a paradigm shift / went into work believing one thing, then something changed</p>\n</li>\n<li>\n<p>Prepare 10-20 questions, including ideas for what you’ll do if things don’t go to plan</p>\n</li>\n<li>\n<p>Give them an idea before the episode starts of what you’re planning to do, where you’re planning to go with the episode, and what you’re hoping you, they, &amp; the audience get out of it</p>\n</li>\n</ul>\n<h3><strong>Misc. current musings:</strong></h3>\n<ul>\n<li>\n<p>How meaningful are LM outputs produced under the coercion of <a href=\"https://www.bentoml.com/blog/structured-decoding-in-vllm-a-gentle-introduction\">structured decoding</a> / strict token limits?</p>\n</li>\n<li>\n<p>After all the <a href=\"https://igi-web.tugraz.at/PDF/85a.pdf\">spiking neurons</a> / <a href=\"https://arxiv.org/abs/2202.09467\">predictive coding</a> / … ‘neuromorphic AI’ work, are there any lessons we can apply from AI back to neuro (e.g. <a href=\"https://arxiv.org/abs/2310.01405\">representation engineering</a> ⇒ neuromodulation)?</p>\n</li>\n<li>\n<p>Perhaps there should be a tiny research / forecasting hackathon dedicated to “what are <a href=\"https://ssi.inc/\">SSI</a> doing, and how can the safety community best respond [to their likely strategy / this flavor of development]?”</p>\n<ul>\n<li>Can we track what they’re doing through their hardware orders?</li>\n</ul>\n</li>\n<li>\n<p>The map &amp; the territory…the <a href=\"https://github.com/centerforaisafety/emergent-values/blob/main/utility_analysis/shared_options/options_hierarchical.json\">strings</a> &amp; the world-states. </p>\n</li>\n<li>\n<p>Reasoning mode / CoT gives a janky, goodharty increase in power + coherence, not a robust one. &amp; the <a href=\"https://lydianottingham.substack.com/p/9030-ml-reading-group-retrospective\">history</a> of ML shows janky workarounds get subsumed by elegant, clean, simple replacements…</p>\n</li>\n<li>\n<p>‘Comparative advantage for skeptics’, anyone?</p>\n</li>\n</ul>\n<h3><strong>Things I want to read pretty soon:</strong></h3>\n<ul>\n<li>\n<p><a href=\"https://arxiv.org/abs/2111.09266\">GFlowNets</a></p>\n</li>\n<li>\n<p>FHI on <a href=\"https://nickbostrom.com/information-hazards.pdf\">infohazards</a>, <a href=\"https://nickbostrom.com/ethics/infinite\">infinite ethics</a>, &amp; <a href=\"https://www.futureofhumanityinstitute.org/\">everything else</a></p>\n<ul>\n<li>We now have an FHI-inspired working group in SF/Berkeley! Lmk if interested :)</li>\n</ul>\n</li>\n<li>\n<p>As always, everything under ‘<a href=\"https://curius.app/lydia-nottingham/read-later\">Read Later!</a>’ But I’m going to introduce two new tags: one ‘skimmed, deprioritized’ and the other ‘read it, made updates, wrote about them, cleared cache’. It will be good.</p>\n</li>\n</ul>\n<p>Read some <a href=\"https://ned.ipac.caltech.edu/level5/Abbott/paper.pdf\">Flatland</a> on the plane.</p>\n<p>‘Choose-your-own-adventure’ is the right mindset for EAG! I can’t wait for next year :)</p>\n<p><em>With huge appreciation to Iggy, who kindly hosted me after briefly meeting at<a href=\"https://www.memoria.day/\">Memoria</a>, &amp; as ever, to the EAG Team!</em></p>\n<p>notwithstanding the cat already being out of the bag wrt agentic systems</p>\n\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/field-notes-from-eag-nyc\">Substack</a></em></p>"
}