{
  "title": "'How to be a Human' Starter Pack",
  "date": "July 05, 2025",
  "subtitle": "exonymically christened",
  "category": "technology & society",
  "content": "<p>)</p>\n<p><img alt=\"Image\" src=\"images/how-to-be-a-human-starter-pack_img_02.png\" /></p>\n<p>The premise:</p>\n<ul>\n<li>\n<p>Unilaterally running events</p>\n</li>\n<li>\n<p>Writing a blog</p>\n</li>\n<li>\n<p>Spaced repetition </p>\n</li>\n</ul>\n<p>For a couple of years, these were things that I really appreciated others doing. I enjoyed going to others’ events, talking to knowledgeable people, and reading their blogs. But that’s all these were—‘things other people do’. Somehow, the activities didn’t quite make the shift to ‘things Lydia can do’.</p>\n<p>Enter NEEThood earlier this year. Out of college and work, I started doing all the above—what else was I going to do with my time? I got huge returns—<a href=\"https://lydianottingham.substack.com/p/9030-ml-reading-group-retrospective\">made friends outside my bubble &amp; traversed the ML landscape at 90/30 Club</a>; articulated murky topics, understood myself &amp; the world better on this blog; absorbed math quicker than ever with LLM-generated Anki cards.</p>\n<p>Before long, I found work—and carried the habits with me. I moved city and ran two events on my first week in Cambridge, MA. When I saw new people jump straight into hosting, I used to think each must be a qualitatively different type of person to me—something in their childhood-upbringing, perhaps, or a ‘Big 5’ quirk of personality difference. Now I have evidence that these habits can become natural, quickly—I just carried them over from my immediately antecedent environment. I guess this is meant to be the point of some exchange programs—enter a place where you can learn good habits from institutions that work well, them carry them seamlessly back with you.¹</p>\n<p>This got me thinking: these are obvious habits. They’re habits basically ~everyone should do, regardless of field—events/blogposts/spaced repetition are so customizable that there’s really ‘something for everyone’. Also, these are somewhat ‘outward-facing’ habits. Outward-facing habits seem really, really great—whether direct, like hosting events, or indirect, like spaced repetition to have better-informed conversations.</p>\n<p>So what other things belong on this list? Here are some of my ideas so far:</p>\n<ul>\n<li>\n<p>Starting an RSS feed</p>\n<ul>\n<li>I sometimes mindlessly scroll Substack/Twitter. What if I just ‘mindlessly’ scroll within a feed I curate, to mitigate the downside of seeing annoying, attention-baiting posts? This seems like it will enhance my evenings/nights.</li>\n</ul>\n</li>\n<li>\n<p>Intentional exercise</p>\n<ul>\n<li>I’m actually pretty confused about this one. If one hour of concerted exercise only buys 2-3 hours of life in expectation, I’m not sure if it’s worth it for me. (At 10+ hours, I think it would be). But I can buy that a more realized version of myself would probably do some.</li>\n</ul>\n</li>\n</ul>\n<p>A related blogpost is ‘<a href=\"https://milan.cvitkovic.net/writing/things_youre_allowed_to_do/\">Things you’re allowed to do</a>’. I skimmed it, and the central example seems like using money to buy services—research, tutoring, cleaning…(I’d add getting private over public transport sometimes).</p>\n<p>But it doesn’t mention running events targeted to people you want to meet, or spaced repetition/RSS feeds, so there’s probably a lot it misses out.</p>\n<p>Some activities are now too ubiquitous/recognized as Good For ~Everyone to feature on this list—brushing one’s teeth, or being literate, for example. I’m interested in addressing the supererogatory category 2-3 levels above that. Can we raise the ‘functioning member of society’ waterline?</p>\n<p>What are some such activities you can think of: ~outward-facing habits that are Clearly Good For ~Everyone To Do?</p>\n<p>¹I feel weird about exchange programs that mandate a return to country of origin. I’d like if the ‘giving back’ component could be replaced by reparations, equity, or mentorship instead, where genuinely commensurate.</p>\n<p><em>This blogpost was written as part of<a href=\"https://bigbeautiful.day\">One Big Beautiful Day</a>!</em></p>\n<p>)</p>\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/how-to-be-a-human-starter-pack\">Substack</a></em></p>"
}