{
  "title": "No taxicab fallacy for knowledge workers",
  "date": "June 04, 2025",
  "subtitle": null,
  "category": "living better",
  "preview_image": "https://substackcdn.com/image/fetch/$s_!9S6g!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f54e66e-d244-4c7c-9079-2f83e52f00c3_724x543.jpeg",
  "content": "<h1>No taxicab fallacy for knowledge workers</h1>\n\n<p>This morning, I read about the ‘<a href=\"https://kaleidoscopemind.substack.com/p/beware-the-taxicab-fallacy\">taxicab fallacy</a>’.</p>\n<blockquote>\n<p>Back when people actually hailed taxis, researchers followed a bunch of drivers to understand how long they chose to work. They found most drivers seemed to set a fixed target for each day: if a normal day brought in $120, they'd drive each day until they reached that amount. On average that meant eight hours, but it varied with demand—when the city was busy with passengers, they might be able to stop in just six hours; on rainy days, they might have to work 12.</p>\n<p>Sounds reasonable, right? Except the implication is that the drivers worked more hours <em>precisely when they earned the least</em>. When they worked six-hour days, they were earning $20/hour; when they worked 12-hour days, they were earning only $10/hour. If they'd flipped their hours—called it early on the tough day and worked late on the good one—they would have averaged $150 across the two days instead of $120! They'd suffer more volatility (making less than they needed one day and a lot more the next), but as long as they knew some good days were coming to balance out the bad ones, they'd end up ahead.</p>\n</blockquote>\n<p>But if you’re a knowledge worker, your time is divided between:</p>\n<ol>\n<li>\n<p>What you can do on the clock</p>\n</li>\n<li>\n<p>What you can do off the clock</p>\n</li>\n</ol>\n<p>Sometimes, you want to use your ‘off the clock’ hours to learn and test out things that might pay off ‘on the clock’. If you give all your best hours to your ‘day job’, you won’t have any for experimentation. And the type of work you can do in your best hours is qualitatively different.</p>\n<p>Knowledge workers ought to keep a few of their best hours ‘off the clock’, not just their worst ones. So the taxicab fallacy applies less.</p>\n\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/no-taxicab-fallacy-for-knowledge\">Substack</a></em></p>"
}