{
  "title": "Sullivan's Travels & 'throwing it all away'",
  "date": "April 21, 2025",
  "subtitle": null,
  "category": "writing",
  "preview_image": "https://substackcdn.com/image/fetch/$s_!RuQp!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F392184a1-bb6d-4780-b537-87bbd2b52d47_210x300.jpeg",
  "content": "<h1>Sullivan's Travels &amp; 'throwing it all away'</h1>\n\n<p>I’ve been watching classic American movies to familiarize myself with this country.</p>\n<p>I think <em>Sullivan’s Travels</em> is masterful in the revelation of an underclass beneath ‘the underclass’, an unknown depth of poverty Sullivan falls into.</p>\n<p>I appreciated the portrayal of people ending up screwed without fair trial. The scene in the church—the repetition of words people have been speaking for thousands of years to try and get us to be less awful to each other, their effectiveness in this scene:</p>\n<blockquote>\n<p>“And once again, brothers and sisters, we’re going to share our pleasure with some neighbors less fortunate than ourselves. Won’t you please clear the <em>first three</em> pews so they may have seats? And when they get here, I’m going to ask you once more: neither by word, nor by action, nor by look to make our guests feel unwelcome. Don’t draw away from them or act high-toned. <strong>For we is all equal in the sight of God.</strong> ” —Preacher, <em>Sullivan’s Travels</em></p>\n</blockquote>\n<p>By the end, we’re not all equal in the eyes of the law—as soon as Sullivan’s identity is revealed, he’s above it (&amp; presumably attempts some legal reform off-screen?)</p>\n<p>Sullivan’s repeatedly thwarted, always fixed-term urge to ‘throw it all away’ seems important. </p>\n<blockquote>\n<p>“No matter where I start out for, I always end up right back here in Hollywood.” —John L. Sullivan, <em>Sullivan’s Travels</em></p>\n<p>“Just when I thought I was out, they pull me back in!” —Michael Corleone, <em>The Godfather III</em></p>\n<p>“The feeling that our choices don’t matter.” —JD Vance, <em>Hillbilly Elegy</em></p>\n</blockquote>\n<p>All these highlight how much escape velocity it takes to strike out in any direction. But Sullivan’s trying to ‘throw it all away’, while the others are striving to build legitimacy. Somehow, I think Sullivan’s struggle to get away from his privileged roots is just as realistic as upwards social mobility traps (&amp; masterfully mirrors them). America’s full of <a href=\"https://www.larserikpersson.se/webcourse/ix-introduction-to-the-theory-of-dynamical-systems-chaos-stability-and-bifurcations/7-classification-of-critical-points/\">stable critical points</a>, and while the country recognizes it’s still young in its trajectory, there’s an anxiety about converging to <a href=\"https://en.wikipedia.org/wiki/Attractor#Basins_of_attraction\">basins of attraction</a>.¹</p>\n<p>¹ <em><a href=\"https://www.lesswrong.com/posts/mYEcfGCDy74NMi7QQ/my-guess-for-why-i-was-wrong-about-us-housing\">My guess for why I was wrong about US housing</a></em> , Stevens </p>\n\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/sullivans-travels-and-throwing-it\">Substack</a></em></p>"
}