{
  "title": "\"Beware the Delmore Effect \"",
  "date": "\"June 09, 2025\"",
  "subtitle": "Sorting what matters most",
  "category": "\"technology & society\"",
  "content": "<p>You should be aware of the Delmore Effect:</p>\n<blockquote>\n<p>“The tendency to provide more articulate and explicit goals for lower priority areas of our lives.” —Cognitive Bias Foundation</p>\n</blockquote>\n<p>It seemed responsible when I first encountered AI’s importance not to swallow it hook-line-and-sinker. So I did a shallow pass over neurotech, kept reading philosophy, and loaded up my math degree with physics-related (differential equations) courses as soon as I got the chance, with a view to understanding unrelated modelling, chaos theory, and so on.</p>\n<p>I won’t argue these things don’t matter (in general and for AI), but in my case, they were trading off against higher-priority ML fundamentals: linear algebra, multivariable calculus, probability theory, CS, and programming.</p>\n<p>I used to be confused about people who had what seemed to me like low-dimensional identities focused on popular, anti-esoteric topics. If you’re into AI, math, philosophy, and startups—who isn’t? It seemed somehow gauche or whatever. Some contrarian instinct in me wanted to escape it. Now I think it’s fantastic. By all means, go straight for what matters most.</p>\n<p>It’s not just a matter of field selection. </p>\n<p>points out that a <em>great</em> paper has higher returns than a great blogpost, but writing a blogpost is easier, so he does it more often. Analogously, I’ve distracted myself with administrative homeostasis over work that might last for years.</p>\n<p>Strive to swerve the Delmore Effect, and I think you’ll be better off for it.</p>\n<p><em>Nuance:<a href=\"https://www.lesswrong.com/posts/RryyWNmJNnLowbhfC/please-don-t-throw-your-mind-away\">Please Don’t Throw Your Mind Away</a></em></p>\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/beware-the-delmore-effect\">Substack</a></em></p>"
}