{
  "title": "\"(Not) Buying a Chinese AgiBot\"",
  "date": "\"June 01, 2025\"",
  "subtitle": "Yours for $110,000",
  "category": "\"technology & society\"",
  "content": "<p><em>Status: I lost interest in this blogpost after seeing the following table. While AgiBot caught my attention with their memetic name and prolific production (1000 units!), other humanoid robots beat them on price (<a href=\"https://robozaps.com/products/unitree-g1\">Basic Unitree G1</a>, yours for $21,600), battery life (<a href=\"https://www.agilityrobotics.com/solution\">Digit,</a> 8 hours), and marketing hype (<a href=\"https://builtin.com/robotics/tesla-robot\">Optimus</a>, “production may begin in 2025, with a projected cost under $30,000”).</em></p>\n<p><em>Still, I think people aren’t talking about robots enough, and in honor of<a href=\"https://less.online/\">LessOnline</a>, I want to push some posts today.</em></p>\n<p><em>^ Comparative analysis from the<a href=\"https://blog.robozaps.com/b/best-humanoid-robots?utm_source=chatgpt.com\">Robozaps blog</a>.</em></p>\n<p>The most prolific producer of humanoid robots is a Chinese firm called AgiBot (pronounced adj-ee-bot). As of January 2025, they claim to have produced 1000 general-purpose embodied robots: <a href=\"https://www.agibot.com/article/242/detail/26.html\">731 bipedal, 269 wheeled</a>. You can see them marching in promotional videos on <a href=\"https://www.agibot.com/\">AgiBot’s site</a>:</p>\n<p>I enjoyed this <a href=\"https://youtube.com/shorts/yGSTjpXzjlY?si=4rTpmjW7GGRfTfLl\">video</a> in which one of their models rides a bicycle.</p>\n<p>To buy directly from AgiBot, you have to write in specifying your “requirements and application scenarios”. AgiBot didn’t get back to me.</p>\n<p>Fortunately, third-party vendors exist.</p>\n<p>quoted me AgiBot A2 at a cheap <strong>$110,000</strong>!</p>\n<p>San Francisco minimum wage increases to $19.18 per hour on July 1, 2025. That’s ~$41,600 per year pre-tax. So <strong>1 AgiBot = ~2.5 years of human work</strong>. Battery life is only 5 hours, but battery swapping is supported, which seems less disruptive than a human lunch break. Based on what I mentioned above, we’ll probably see robots whose <strong>upfront cost equals &lt;1 year of human labor within a year or two</strong>.</p>\n<p>Here are some questions I have about this:</p>\n<ul>\n<li>\n<p>Will training robots to operate in e.g. fast food franchise kitchens become a ‘technical specialist’ human job? Will it be provided by vendors of the robots? Third-party contractors?</p>\n</li>\n<li>\n<p>How much assistance will the robots need to operate reliably in new environments? How many hours of demonstration time will they need? How soon can this be fully provided by humans with no specialized technical knowledge? </p>\n</li>\n<li>\n<p>Will the norm just be having 1-2 supervising humans per store?</p>\n</li>\n<li>\n<p>Will human servers hang on in e.g. fine dining restaurants or not? Will it be part of the service or gauche?</p>\n</li>\n<li>\n<p>Will the second-hand robot market operate like the second-hand car market in terms of depreciation rates, etc.?</p>\n</li>\n<li>\n<p>Will humanoid robots prevail, or will we get more Frankenstein solutions, like <a href=\"https://github.com/TheRobotStudio/SO-ARM100\">HuggingFace’s SO-101 arm</a>?</p>\n</li>\n<li>\n<p>Will AgiBot corner the open-source humanoid robot market?</p>\n</li>\n</ul>\n<p>As of May 2024, there were apparently at least <a href=\"https://www.theguardian.com/science/article/2024/may/30/chinese-armys-latest-weapon-gun-toting-dog\">1500 copies</a> of Boston Dynamics’ security-patrolling dog, Spot, deployed worldwide.¹ </p>\n<p>I’d love to talk more about robots!</p>\n<hr />\n<p><em>Originally published on <a href=\"https://lydianottingham.substack.com/p/not-buying-a-chinese-agibot\">Substack</a></em></p>"
}